tutorials/simpleFoam/pitzDaily/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p PCG
    {
        preconditioner
        {
            type         DIC;
        }

        tolerance        1e-06;
        relTol           0.01;
        minIter          0;
        maxIter          1000;
    };

    U PBiCG
    {
        preconditioner
        {
            type         DILU;
        }

        tolerance        1e-05;
        relTol           0.1;
        minIter          0;
        maxIter          200;
    };

    k PBiCG
    {
        preconditioner
        {
            type         DILU;
        }

        tolerance        1e-05;
        relTol           0.1;
        minIter          0;
        maxIter          200;
    };

    epsilon PBiCG
    {
        preconditioner
        {
            type         DILU;
        }

        tolerance        1e-05;
        relTol           0.1;
        minIter          0;
        maxIter          200;
    };

    R PBiCG
    {
        preconditioner
        {
            type         DILU;
        }

        tolerance        1e-05;
        relTol           0.1;
        minIter          0;
        maxIter          200;
    };

    nuTilda PBiCG
    {
        preconditioner
        {
            type         DILU;
        }

        tolerance        1e-05;
        relTol           0.1;
        minIter          0;
        maxIter          200;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
    nuTilda         0.7;
}


// ************************************************************************* //
